<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
<!DOCTYPE html>
<html>
<head>
    <title>Lab-9</title>
</head>
<body>
<a href="Date">Задание 2а</a>
<p>Напишите первый сервлет, который возвращает текущее время в
    ответ на нажатие кнопки пользователем на странице (JSP).Выведите также версию и номер протокола, IP-адреса клиента,
    от имени которого пришел запрос и его имя, имя метода
    доступа к ресурсам, на основе которого построен запрос, URL .</p>
<a href="Header">Задание 2b</a>
<p>Извлеките всю информацию о заголовке запроса.</p>
<a href="Registration">Авторизация</a>
<a href="Cookies">Получить куки</a>
</body>
</html>